Dlubal.RFEM5.LoadCase
Load case parameters.

Dlubal.RFEM5.LoadCase.Loading
Load number and type

Dlubal.RFEM5.LoadCase.ID
Identifier

Dlubal.RFEM5.LoadCase.Comment
Comment

Dlubal.RFEM5.LoadCase.Tag
Tag

Dlubal.RFEM5.LoadCase.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LoadCase.Description
Description

Dlubal.RFEM5.LoadCase.ToSolve
Use this load case in solver

Dlubal.RFEM5.LoadCase.ActionCategory
Action category

Dlubal.RFEM5.LoadCase.UserDefinedAction
User-defined action category

Dlubal.RFEM5.LoadCase.SelfWeight
Consider self-weight with factor

Dlubal.RFEM5.LoadCase.SelfWeightFactor
Self-weight factor